"""
1.Вводится список целых чисел в одну строчку через пробел. Необходимо оставить в нем только двузначные числа. Реализовать программу с использованием функции filter. Результат отобразить на экране в виде последовательности оставшихся чисел в одну строчку через пробел.


 пример  - 8 11 0 -23 140 1 => 11 -23

 print(*filter(lambda x: len(str(abs(int(x)))) == 2, input().split()))
"""
# x = map(int, input("введите числа: ").split())
# print(list(filter(lambda y: (y > 9 and y < 100) or (y < -9 and y > -100), x)))

"""
/////////////////////////////////////////////////////////////////////////////////////////////////////////////////
 Вводится натуральное число N. С помощью list comprehension сформировать двумерный список размером N x N, состоящий из нулей, а по главной диагонали - единицы. (Главная диагональ - это элементы, идущие по диагонали от верхнего левого угла матрицы до ее нижнего правого угла). Результат вывести в виде таблицы чисел как показано в примере ниже.


Sample Input:
4
Sample Output:
1 0 0 0
0 1 0 0
0 0 1 0
0 0 0 1

N = int(input())
lst = [[1 if i == j else 0 for j in range(N)] for i in range(N)]
for r in lst:
    
    print(*r)
"""
# n = int(input("введите число: "))

# for x in range(n):
#     for y in range(n):
#         if x == y:
#             print(1, end = "\t")
#         else:
#             print(0, end = "\t")
#     print()

"""
///////////////////////////////////////////////////////////////////////////////////////////////////////////////////

3. Преобразовать набора списков 
users = ['user1','user2','user3','user4','user5']
ids = [4, 5, 9, 14, 7]
salary = [111,222,333]
в другой набор 

['user1', 4, 111]
['user2', 5, 222]
['user3', 9, 333]

и потом вернуть в исходное состояние

['user1', 'user2', 'user3']
[4, 5, 9]
[111, 222, 333]
"""
# users = ['user1','user2','user3','user4','user5']
# ids = [4, 5, 9, 14, 7]
# salary = [111,222,333]

# a,b,c = map(list,zip(users, ids, salary))
# print(a,b,c, sep="\n")

# a,b,c= map(list,zip(a,b,c))
# print(a,b,c, sep="\n")

